{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v4.22 — EMG Fatigue 1D-CNN",
  "convertedBy": null,
  "modelTopology": {
    "keras_version": "2.17.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 400, 1],
              "dtype": "float32",
              "sparse": false,
              "name": "input"
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d",
              "filters": 16,
              "kernel_size": [5],
              "strides": [1],
              "padding": "same",
              "activation": "relu",
              "kernel_regularizer": {
                "class_name": "L2",
                "config": { "l2": 0.001 }
              }
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d",
              "pool_size": [2],
              "strides": [2],
              "padding": "valid"
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_1",
              "filters": 32,
              "kernel_size": [5],
              "strides": [1],
              "padding": "same",
              "activation": "relu",
              "kernel_regularizer": {
                "class_name": "L2",
                "config": { "l2": 0.001 }
              }
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_1",
              "pool_size": [2],
              "strides": [2],
              "padding": "valid"
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_2",
              "filters": 64,
              "kernel_size": [3],
              "strides": [1],
              "padding": "same",
              "activation": "relu",
              "kernel_regularizer": {
                "class_name": "L2",
                "config": { "l2": 0.001 }
              }
            }
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "rate": 0.3
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "units": 32,
              "activation": "relu",
              "kernel_regularizer": {
                "class_name": "L2",
                "config": { "l2": 0.001 }
              }
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "rate": 0.2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "units": 2,
              "activation": "softmax"
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": ["accuracy"],
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "learning_rate": 0.001,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "conv1d/kernel", "shape": [5, 1, 16], "dtype": "float32" },
        { "name": "conv1d/bias", "shape": [16], "dtype": "float32" },
        { "name": "conv1d_1/kernel", "shape": [5, 16, 32], "dtype": "float32" },
        { "name": "conv1d_1/bias", "shape": [32], "dtype": "float32" },
        { "name": "conv1d_2/kernel", "shape": [3, 32, 64], "dtype": "float32" },
        { "name": "conv1d_2/bias", "shape": [64], "dtype": "float32" },
        { "name": "dense/kernel", "shape": [64, 32], "dtype": "float32" },
        { "name": "dense/bias", "shape": [32], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [32, 2], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [2], "dtype": "float32" }
      ]
    }
  ]
}
